In [6]:
from pandas import read_pickle
from pandas import DataFrame

In [4]:
pickle = read_pickle('pickled_series.pkl')

In [5]:
pickle.head()

25     $98.38
216    $55.09
247     $6.13
293    $70.18
465    $19.53
dtype: object

In [13]:
df = DataFrame(pickle)

In [14]:
df.head()

          0
25   $98.38
216  $55.09
247   $6.13
293  $70.18
465  $19.53

In [16]:
df.iloc[136]

0    $62.92
Name: 13704, dtype: object